Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: སྔོན་དག་དགེ་བ་བྱས་པ་རྣམས་ཀྱང་དྲན། །
en: He reminds them of their previous righteous deeds.

source: སྔོན་ནི་བསོད་ནམས་ཅི་འདྲ་བྱས་པ་རྣམས། །དེ་དག་རྣམས་ཀྱང་སྟོན་པའི་མཐུས་དྲན་ཏེ། །
en: “Because of the teacher’s power, they remember Whatever wholesome deeds they performed in the past.

source: དེ་དག་དྲན་ནས་གནས་ནི་གསུམ་ལ་འཁོད། །ཐར་པའི་གནས་ལས་ཕྱིར་ཡང་མི་ལྡོག་འགྱུར། །
en: Their practice becomes firmly established through the three vehicles. They do not regress, and they remain free from confusion.

source: བདེ་གཤེགས་སྔོན་གྱི་སྦྱོར་བ་མཐའ་ཡས་ཏེ། །
en: “The Sugata’s boundless previous practice

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ནི་བསམ་མི་ནུས། །
en: Cannot be conceived by any sentient being.

source: མཐའ་ཡས་གྲགས་པའི་སྟོབས་ནི་བརྒྱད་པ་ལ། །རྒྱལ་སྲས་བདག་ཉིད་ཆེན་པོ་དད་པར་འགྱུར། །
en: This is the eighth power of the one whose renown is endless, In which the children of the Victorious One, the great beings, have faith.

source: ཤཱ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བརྒྱད་པ་སྟེ། སྟོབས་དེ་དང་ལྡན་པས་ཞེས་བྱ་བ་ནས་ཆོས་དང་འཐུན་པར་ཞེས་བྱ་བའི་བར་དུའོ། །
en: “This, Śāriputra, is the eighth of the tathāgatas’ tathāgata powers, and having attained that power, and so forth, until as nobody has legitimately turned.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ལྷའི་མིག་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱེད་པ་མཁྱེན་པའི་སྟོབས་གང་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་བླ་ན་མེད་པའི་ཡེ་ཤེས་དང་། མིའི་ལས་ཤིན་ཏུ་འདས་པའི་ལྷའི་མིག་རྣམ་པར་དག་པས་སེམས་ཅན་རྣམས་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་དང་། བཟང་པོ་དང་། ངན་པ་དང་། ཁ་དོག་མཛེས་པ་དང་། ཁ་དོག་མི་སྡུག་པ་དང་། བདེ་འགྲོར་འགྲོ་བ་དང་། ངན་འགྲོར་འགྲོ་བ་རྣམས་གཟིགས་སོ། ། སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན། ངག་གིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན། ཡིད་ཀྱིས་ཉེས་པར་སྤྱོད་པ་དང་ལྡན་པ། འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ། ལོག་པར་ལྟ་བ་དག་སྟེ། དེ་དག་ལོག་པར་ལྟ་བའི་ལས་ཡང་དག་པར་བླངས་པའི་རྒྱུས་ལུས་ཞིག་སྟེ། ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བར་སྐྱེའོ། ། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དུའང་དེ་བཞིན་ནོ། ། ཡང་སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན། ངག་གིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན། ཡིད་ཀྱིས་ལེགས་པར་སྤྱོད་པ་དང་ལྡན་ཏེ། འཕགས་པ་རྣམས་ལ་སྐུར་པ་མི་འདེབས་པ་ཡང་དག་པར་ལྟ་བ་སྟེ། དེ་དག་ཡང་དག་པར་ལྟ་བ་ཡང་དག་པར་བླངས་པའི་རྒྱུས་ལུས་ཞིག་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷར་སྐྱེའོ། ། ཞེས་སེམས་ཅན་རྣམས་ཀྱི་ལས་ཇི་ལྟར་བསགས་པ་རྣམས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “What is the Tathāgata’s power of direct knowledge of recollection and realization by means of divine sight like? Śāriputra, by means of the unsurpassed tathāgata knowledge of the divine immaculate eye that transcends the human realm, the Tathāgata sees sentient beings. He knows their deaths and their rebirths, whether those are adverse or fortunate, whether they become beautiful or ugly, and whether they go to higher realms or lower realms, and he knows that this accords with the ripening of the fruits of these sentient beings’ actions. When sentient beings who engage in bodily misconduct, verbal misconduct, or mental misconduct, who denigrate the noble ones, or who hold wrong views see their bodies perish, the results of the actions they have performed based on wrong views will remain, and because of these actions, they will end up in the unfavorable lower realms after death, reborn in the hell realm or else among animals or in the spirit world governed by Yama. On the other hand, when the bodies of sentient beings who engage in good bodily conduct, in good verbal conduct, and in good mental conduct, who do not denigrate the noble ones, and who hold right views perish, the results of the actions they have performed based on right views will remain, and because of these actions, they will be reborn in favorable states, in the heavenly divine abodes. He knows exactly what the actions accumulated by sentient beings are in this regard.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ལྷའི་མིག་དེ་ནི་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ནམ་མཁའི་མཐའ་ཆོས་ཀྱི་དབྱིངས་ཚད་མེད་པ། བརྗོད་དུ་མེད་པ། གང་གཱའི་ཀླུང་གི་བྱེ་མ་ལས་ཀྱང་ཤིན་ཏུ་འདས་པ་ཐམས་ཅད་ན་སངས་རྒྱས་ཀྱི་ཞིང་གང་ཇི་སྙེད་སྣང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་འཚིག་པ་དང་། འཇིག་པ་དང་། འཆགས་པར་གཟིགས་སོ། ། སེམས་ཅན་གང་དག་ཁ་ཅིག་སྣང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་འཆི་འཕོ་བ་དང་སྐྱེ་བར་གཟིགས་སོ། ། བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཁ་ཅིག་སྣང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་དགའ་ལྡན་གནས་ནས་ འཆི་འཕོ་བ་དང་། མའི་རུམ་དུ་འཇུག་པ་དང་། བཙའ་བ་དང་གོམ་པ་བདུན་འདོར་བ་དང་། བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་འཇུག་པ་དང་། མངོན་པར་འབྱུང་བར་གཟིགས་སོ། ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་དག་ཁ་ཅིག་སྣང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གཟིགས་སོ། ། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་སྐོར་བ་དང་། ཚེའི་འདུ་བྱེད་འདོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་ཡང་གཟིགས་སོ། ། ཉན་ཐོས་གང་དག་ཁ་ཅིག་སྣང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གཟིགས་སོ། ། རང་སངས་རྒྱས་གང་དག་ཁ་ཅིག་སྣང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་རྫུ་འཕྲུལ་སྟོན་ཅིང་ཡོན་སྦྱོང་བར་གཟིགས་སོ། ། སེམས་ཅན་གང་དག་སྣང་བར་མ་གྱུར་པ་ཕྱི་རོལ་གྱི་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྣམས་ཀྱི་མིག་གི་ལམ་དུ་མི་འགྲོ་བ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་མཐོང་བར་མི་འགྱུར་བ་དེ་དག་དེ་བཞིན་གཤེགས་པའི་ལྷའི་མིག་གིས་གཟིགས་སོ། ། ཡང་དེ་བཞིན་གཤེགས་པས་ཤིང་རྟའི་འཕང་ལོའི་ཚད་ཙམ་ལ་སྣང་བར་མ་གྱུར་པའི་སེམས་ཅན་རྣམས་གཟིགས་པ་དེ་དག་ནི་ཤིན་ཏུ་མང་གི། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ལྷ་དང་། མི་རྣམས་ནི་དེ་ལྟ་མ་ཡིན་ཏེ དེ་ལྟར་མི་སྣང་བར་གྱུར་པའི་སེམས་ཅན་གྱི་ཁམས་ཀྱང་ཚད་མེད་དོ། །
en: “In the buddha fields in the ten directions, to the very limit of space, in the immeasurable, indescribable totality of phenomena, greater in scope than the grains of sand in the river Ganges, the divine sight of the Tathāgata sees any appearances that arise, everything that is consumed, that perishes, or that develops as a buddha field. He sees the circumstances of the death and rebirth of any sentient being that appears. He sees that any bodhisatvas that appear all die and leave their existence in Tuṣita Heaven, enter the mother’s womb, are born, take the seven steps, leave the royal apartments, and depart. He sees that any lords, buddhas, that appear all realize complete awakening, turn the wheel of the Dharma, reach the end of conditioned life, and enter nirvāṇa. He sees that any śrāvakas that appear all attain complete nirvāṇa. He sees that any pratyekabuddhas who appear all have magical vision, and he sees how they purify the gifts they receive. Those beings who have not yet appeared cannot be perceived by those non-Buddhist sages who possess the five superior abilities. They do not appear to the śrāvakas, the pratyekabuddhas, or the bodhisatvas, but they do appear to divine sight of the Tathāgata. Within just an area the size of a cart wheel, the number of invisible sentient beings apparent to the Tathāgata are much more numerous than the gods and human beings of the threefold thousand great thousand worlds. The realm of beings who are not apparent is truly immeasurable.

source: འདི་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ལྷའི་མིག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ན་སེམས་ཅན་གང་སངས་རྒྱས་ཀྱིས་འདུལ་བར་འགྱུར་ཞེས་སེམས་ཅན་གྱི་ཁམས་ལ་གཟིགས་ཏེ། སེམས་ཅན་ཇི་ཙམ་སངས་རྒྱས་ཀྱིས་འདུལ་བར་འགྱུར་བ་དེ་དག་གི་མདུན་ན་དེ་བཞིན་གཤེགས་པ་བཞུགས་ཤིང་སེམས་ཅན་དེ་དག་འདུལ་ཡང་སེམས་ཅན་གཞན་གྱིས་མི་ཤེས་སོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ལྷའི་མིག་རྗེས་སུ་དྲན་པ་མངོན་སུམ་དུ་བྱེད་པ་མཁྱེན་པའི་སྟོབས་ནི་མཐའ་ཡས་མུ་མེད་དེ། ནམ་མཁའ་དང་མཚུངས་ཤིང་མཉམ་མོ། ། བྱང་ཆུབ་སེམས་དཔས་དེ་ཐོས་ནས་མངོན་པར་དད་པ་ནས། ནམ་མཁའ་ལྟ་བུར་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་ཞེས་བྱ་བའི་བར་དུའོ། །
en: “So it is, Śāriputra, that the Tathāgata scans the realm of sentient beings within the fields of the Buddha with his divine sight, to see which sentient beings could potentially be trained by the Buddha. The Tathāgata appears to every sentient being who could potentially be trained by the Buddha and trains that sentient being, without other sentient beings being aware of it. In this way, Śāriputra, the Tathāgata’s power of direct knowledge of recollection and realization by means of divine sight is as boundless as space, and when the bodhisatva learns of this, he develops great faith, and so forth, as this power is just as inconceivable as space.”

source: བདེ་བར་གཤེགས་པའི་ལྷ་མིག་དྲི་མེད་དེ། །
en: “The divine sight of the Sugata is spotless,

source: བསྐལ་པ་བྱེ་བར་དགེ་བའི་ལས་ཀྱིས་སྦྱངས། །
en: Having been purified by virtuous actions for millions of eons.

source: དེས་ནི་རྒྱལ་བས་ཕྱོགས་བཅུ་སངས་རྒྱས་ཞིང་། །རྒྱ་ཆེན་བསམ་གྱིས་མི་ཁྱབ་རྣམས་ཀྱང་གཟིགས། །
en: With it, the Victorious One sees the vast and inconceivable Buddha fields in the ten directions.

source: འབྱུང་བ་དང་ནི་འཇིག་པ་ཇི་སྙེད་པ། །ཁ་ཅིག་མེ་ཡིས་འཁོར་ཅིང་སེམས་ཅན་གནས། །
en: “Whether they are evolving or being destroyed, Inhabited by beings or wreathed in flames,

source: ཁ་ཅིག་སངས་རྒྱས་ལྡན་ཞིང་ཁ་ཅིག་སྟོང་། །ཐམས་ཅད་རང་བྱུང་གི་ནི་སྤྱན་གྱིས་གཟིགས། །
en: Whether a buddha is present there or is absent, He sees them all with his self-arisen eye.

source: སེམས་ཅན་ཁམས་ནི་རྒྱ་ཆེན་བསམ་མི་ཁྱབ། །གཟུགས་ཅན་གཟུགས་མེད་གང་དག་ཇི་སྙེད་དང་། །གང་དག་ངན་འགྲོར་ལྟུང་དང་བདེར་འགྲོ་བ། །ཐམས་ཅད་རང་བྱུང་གི་ནི་སྤྱན་གྱིས་གཟིགས། །
en: “The vast realm of sentient beings is inconceivable, But however many they are, with form or formless, Whether they end up in lower realms or higher, He sees them all with his self-arisen eye.

source: སངས་རྒྱས་བྱེ་བ་མང་པོ་གང་བཞུགས་དང་། །རང་བྱུང་འདྲེན་པ་མྱ་ངན་གང་འདས་དང་། །རང་རྒྱལ་གང་དང་ཉན་ཐོས་གང་ཡོད་པ། །ཐམས་ཅད་རང་བྱུང་གི་ནི་སྤྱན་གྱིས་གཟིགས། །
en: “Wherever the many millions of buddhas may reside, Wherever the self-arisen guides who have attained nirvāṇa may be, Wherever the pratyayajinas or śrāvakas are, He sees them all with his self-arisen eye.

source: བྱང་ཆུབ་སེམས་དཔའ་སྲོག་ཆགས་ཕན་འདོད་པ། །གང་དག་བྱང་ཆུབ་སྤྱོད་པ་མཆོག་སྤྱོད་ཅིང་། །ལ་ལ་གཞི་མེད་གནས་ནི་རྟོག་གྱུར་པ། །ཐམས་ཅད་རང་བྱུང་འདྲེན་པ་དག་གིས་གཟིགས། །
en: “Whatever excellent activities of awakening The bodhisatvas who wish to benefit the living perform, And whoever awakens to the unsupported state,

source: གང་གིས་སྲོག་ཆགས་ཤིན་ཏུ་ཕྲ་མཐོང་བ། །བདེ་གཤེགས་མིག་ནི་འདི་འདྲ་དྲི་མ་མེད། །
en: He sees them all with his self-arisen eye. “Such is the spotless vision of the Sugata With which he sees the very tiniest of creatures.

source: མིག་སྟོབས་བསམ་གྱིས་མི་ཁྱབ་དགུ་པ་སྟེ། །
en: This is the ninth inconceivable power of vision

source: རྒྱལ་སྲས་དེས་པ་རྣམས་ནི་མངོན་པར་དད། །
en: In which the gentle children of the Victorious One have faith.

source: ཤ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དགུ་པ་སྟེ། སྟོབས་དེ་དང་ལྡན་པས་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་ཞིང་འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་པ་ནས། སུས་ཀྱང་འཇིག་རྟེན་འདིར་ཆོས་དང་འཐུན་པ་ཞེས་བྱ་བའི་བར་དུའོ། །
en: “This, Śāriputra, is the ninth of the tathāgatas’ tathāgata powers, and having attained that power he asserts the state of the supreme bull and roars the roar of the true lion, and so forth, until as nobody in this world has legitimately turned.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་བྱེད་པ་མཁྱེན་པའི་སྟོབས་གང་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བླ་ན་མེད་པའི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་ཟག་པ་ཐམས་ཅད་ཟད་པས་བདག་སྐྱེ་བ་ནི་ཟད། ཚངས་པར་སྤྱོད་པ་ལ་ནི་བསྟེན། བྱ་བ་ནི་བྱས་ཏེ། འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་ཟག་པ་མེད་པ། སེམས་རྣམ་པར་གྲོལ་བ། རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: “What is the Tathāgata’s power of knowing through direct experience that the defilements have been eliminated? Śāriputra, with the unsurpassed tathāgata power of knowing that all defilements have been eliminated, the Tathāgata has perfectly clear and definitive knowledge of himself regarding his lack of defilements and the liberation of his mind, thinking, ‘I have exhausted birth, lived a life of purity, and done what needed to be done, and I know there will be no subsequent existence after this one.’

source: དེ་ལ་དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་མཁྱེན་པའི་སྟོབས་དེ་ནི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་བཅོམ་པའོ། ། ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་ཟག་པ་ཟད་པ་ནི་ཚད་དུ་བྱས་པའི་བག་ཆགས་ཡང་དག་པར་བཅོམ་པའོ། ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ཟག་པ་ཟད་པ་ནི་ཚད་ཡོད་པ་སྟེ། སྙིང་རྗེ་ཆེན་པོ་དང་བྲལ་བ། སྤོབས་པ་དང་བྲལ་བའོ། ། དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་ནི་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་བཅོམ་པ། སྙིང་རྗེ་ཆེན་པོས་ཀུན་ཏུ་བཟུང་བ། མི་འཇིགས་པ་དང་། སྤོབས་པ་ལ་ལྟ་བ་འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་པ་སྟེ། སྐད་ཅིག་གཅིག་དང་ལྡན་པའོ། ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་ལ་ལས་ཀྱི་བག་ཆགས་མེད། ཉོན་མོངས་པའི་བག་ཆགས་མེད། སྤྱོད་ལམ་འཁྲུལ་པའི་བག་ཆགས་མེད་དོ། ། འདི་ལྟ་སྟེ། །ཤཱ་རིའི་བུ་ནམ་མཁའ་ཡོངས་སུ་དག་པས་རྡུལ་དང་དུ་བའི་འཁྲུག་པ་དང་ལྷན་ཅིག་ཏུ་མི་གནས་པ་དེ་བཞིན་དུ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་མཁྱེན་པའི་སྟོབས་ཀྱང་ཉོན་མོངས་པའི་བག་ཆགས་ཐམས་ཅད་དང་ལྷན་ཅིག་ཏུ་མི་གནས་སོ། ། དེ་ཟག་པ་ཟད་པར་མཁྱེན་པ་དེ་ལྟ་བུ་ལ་རབ་ཏུ་གནས་ནས་ཟག་པ་དང་བཅས་པ་ལེན་པ་དང་བཅས་པའི་སེམས་ཅན་རྣམས་ལ་ཟག་པ་ཟད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། ། ལེན་པ་སྤང་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། ། ཀྱེ་མ་སེམས་ཅན་རྣམས་ནི་ཡང་དག་པ་མ་ཡིན་པ་ཀུན་རྟོག་པ་ལས་བྱུང་སྟེ། ཟག་པ་དང་། ལེན་པ་རྣམས་མི་བསྐྱེད་པའི་ཕྱིར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཁྱེད་ཀྱིས་རབ་ཏུ་རྟོགས་ཤིག་ཅེས། དེ་དག་ལ་དེ་བཞིན་གཤེགས་པས་དཔེ་དང་ཚུལ་གྱིས་ཅི་ནས་ཀྱང་ཟག་པ་རྣམས་ཡང་དག་པ་མ་ཡིན་པའོ་ཞེས་ཡང་དག་པར་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་ཤེས་པར་འགྱུར་ཞིང་ཤེས་ནས་ ཀྱང་ཆོས་གང་ཡང་མི་ལེན་ཏེ ལེན་པ་མེད་པར་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བ་དེ་ལྟ་བུ་དེ་ལྟ་བུར་ཆོས་སྟོན་ཏོ། །
en: “The Tathāgata’s power of knowing that the defilements have been eliminated means that all habitual patterns have been done away with. If one practices within the parameters of the Śrāvakayāna, the defilements are eliminated, but habitual patterns are not completely done away with. If one practices within the parameters of the Pratyekabuddhayāna, the defilements are eliminated, but great compassion and eloquence are lacking. The Tathāgata’s elimination of the defilements includes all supreme qualities, as all habitual patterns have been done away with. It encompasses great compassion, and it also includes within its scope his confidence and his power of eloquent speech. The Tathāgata’s elimination of the defilements is thus unsurpassed by anything in the whole world. It is characterized by momentariness. How is this the case? The Tathāgata is not affected by any habitual patterns resulting from previous actions, any habitual patterns resulting from vices, or any habitual patterns resulting from mistaken forms of practice. Śāriputra, just as space is completely pure and not affected by pollution in the form of dust or smoke, Śāriputra, the Tathāgata’s power of knowing that the defilements have been eliminated is not affected by any habitual vices. He dwells in this knowledge of the elimination of the defilements and teaches the Dharma so that sentient beings who are afflicted by the defilements and by clinging can eliminate their defilements. He teaches the Dharma in order to destroy clinging, ‘How sad! Sentient beings are engrossed in false mental constructions. You should develop understanding of the way things really are so that the defilements and clinging will no longer arise.’ The Tathāgata teaches them the Dharma using similes and appropriate examples so that they gain understanding of how things actually are, that the defilements are not real, and when they reach this understanding they no longer cling to any phenomena. As they no longer cling to anything, they attain complete nirvāṇa.

source: དེ་ལྟར་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཟག་པ་རྣམས་རབ་ཏུ་མཁྱེན་ཏོ། ། ཟག་པ་ཀུན་འབྱུང་བ་དང་། ཟག་པ་འགག་པ་དང་། ཟག་པ་འགག་པར་འགྱུར་བའི་ལམ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་རབ་ཏུ་མཁྱེན་ཏེ་མཁྱེན་ནས་ཀྱང་དེ་བཞིན་དུ་ཆོས་སྟོན་ཏོ། ། བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པའི་ཟག་པ་ཟད་པ་མངོན་སུམ་དུ་བྱེད་པ་མཁྱེན་པའི་སྟོབས་དེ་ཐོས་ནས་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག ། སོམ་ཉི་མེད་ཅིང་ཐེ་ཚོམ་མི་ཟ་བ་ནས་ངོ་མཚར་དང་རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་དོ། །
en: “In this way, Śāriputra, the Tathāgata knows the defilements of all sentient beings. He has perfect and correct knowledge of how the defilements come about, of the destruction of the defilements and the way to destroy the defilements, and with this knowledge he teaches the Dharma. When the bodhisatva learns of this power of the Tathāgata, of knowing through direct experience that the defilements have been eliminated, he develops great faith, trust, and confidence, and he has no uncertainty or doubt, and so forth, and he considers it to be truly wondrous and extraordinary.”

source: འདྲེན་པའི་ཟག་པ་མེད་པའི་ཡེ་ཤེས་ནི། །རྒྱ་ཆེན་སྒྲིབ་མེད་དག་པ་ཚད་མེད་དེ། །
en: “The leader’s knowledge of the elimination of the defilements Is vast and unobscured, immeasurably pure.

source: སྟོབས་བཅུའི་སྟོབས་ནི་དེ་དང་ལྡན་པས་ན། །
en: With the power of this tenth power

source: ཞི་བའི་བྱང་ཆུབ་མཆོག་འདི་རབ་ཏུ་གསུང་། །
en: He announces the supreme peace of awakening.

source: ཉན་ཐོས་རྣམས་ཀྱི་ཟག་ཟད་ཡེ་ཤེས་ནི། །བག་ཆགས་མ་བཅོམ་ཚད་དང་ལྡན་པ་ཡིན། །
en: “The śrāvakas know how to eliminate the defilements, But they have not overcome their habits, so their knowledge is not unlimited.

source: མི་ཡི་དམ་པ་འདྲེན་པ་མཆོག་རབ་ཀྱི། །བག་ཆགས་བཅོམ་ཞིང་ཚད་དང་ལྡན་མ་ཡིན། །
en: The best of men, the principal guide, Has overcome his habits, so there is no limitation.

source: དེ་བཞིན་རང་རྒྱལ་བྱང་ཆུབ་གང་རེག་པ། །དེ་ལ་སྙིང་རྗེ་ཆེ་དང་སྤོབས་པ་མེད། །
en: “It is the same for those who reach awakening in isolation, But they do not have great compassion or eloquence.

source: བཅོམ་ལྡན་འདས་ནི་ཟག་པ་ཡོངས་ཟད་པ། །སྙིང་རྗེ་ཆེ་དང་སྤོབས་པ་ཚད་མེད་དོ། །
en: The Lord has fully eliminated the defilements, And his great compassion and eloquence are immeasurable.

source: སངས་རྒྱས་ཟག་ཟད་མཁྱེན་ལ་གནས་ནས་ནི། །འགྲོ་བའི་ཟག་པ་ཡང་དག་མ་ཡིན་ཞིང་། །རིགས་པའི་གནས་ཀྱི་ཚུལ་འདི་མ་ཤེས་པས། །ཆོས་འདི་ཐམས་ཅད་ལོག་པར་ཞུགས་མཁྱེན་ཏེ
en: “The Buddha abides in the knowledge that the defilements have been eliminated, And he knows that the defilements of living beings are not real. He knows that they engage with all phenomena in distorted ways And that they do not understand how to act in accordance with logical principles.

source: དེ་ལ་རྒྱལ་བ་སྙིང་རྗེ་ཆེར་བསྐྱེད་ནས། །
en: “The Victorious One feels great empathy for them,

source: ཆོས་འདི་མི་རྟག་སྟོང་པ་བདག་མེད་ཆོས། །དངོས་མེད་གསོག་སྟེ་མཆོག་ཏུ་ཞི་བ་ཡི། །ས་ལ་རྟོགས་ཤིང་ལྟོས་ཤེས་རབ་ཏུ་སྟོན། །
en: And so he explains the teachings of impermanence, emptiness, and lack of self: ‘Investigate and see that phenomena do not exist, that they are hollow. This is the very highest level of peace.’

source: འདི་ལ་སྐྱེས་བུ་སྲོག་དང་གང་ཟག་དང་། །ཤེད་སྐྱེས་ཤེད་བུ་བྱེད་པ་པོ་ཡང་མེད། །
en: “There is no man, no life force, no person to be found here, And likewise no human being, soul, or one who acts,

source: ཆོས་འདི་ཐམས་ཅད་ལོག་པར་ཆགས་པས་ན། །
en: But as they misconceive all these phenomena,

source: སྟོན་པ་སྙིང་རྗེ་བསྐྱེད་ནས་ཐར་སྟོན་ཀྱང་། །བདེ་བར་གཤེགས་ལ་སྐྱོ་བ་ཡོད་མེད་དེ། །
en: The compassionate teacher explains liberation. “The Sugata never feels discouraged,

source: ཡང་དག་ཡེ་ཤེས་ནམས་ཀྱང་ཉམས་པ་མེད། །
en: Nor does his true knowledge ever falter.

source: དེའི་ཕྱིར་རྒྱལ་བ་རྟག་ཏུ་རྣལ་འབྱོར་སྦྱོར། །
en: Because of this, the Victorious One is always committed

source: འགྲོ་ལ་ཕན་ཕྱིར་ཆོས་རྣམས་རབ་ཏུ་སྟོན། །
en: To imparting the Dharma for the benefit of living beings.

source: འདི་ནི་ཕ་རོལ་སྨྲ་བ་འཇོམས་པའི་སྟོབས། །མཐའ་ཡས་ནམ་མཁའ་འདྲ་བ་བཅུ་པ་སྟེ། །
en: “This power that crushes opponents is the tenth, Comparable in its scope to the limitless heavens.

source: མགོན་པོ་སྟོབས་བཅུ་དེ་ལ་གནས་གྱུར་ནས། །
en: Firmly established in this power, the protector

source: མཚུངས་མེད་འཁོར་ལོ་དམ་པ་རབ་ཏུ་བསྐོར། །
en: Sets the incomparable wheel in motion.

source: ཤ་རིའི་བུ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་པ་སྟེ། སྟོབས་དེ་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་ཞིང་འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་སྟེ། འཇིག་རྟེན་འདིར་དགེ་སྦྱོང་ངམ། བྲམ་ཟེའི་བར་དུ་སུས་ཀྱང་ཆོས་དང་འཐུན་པར་རབ་ཏུ་མ་བསྐོར་བ། ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་ཏོ། །
en: “This, Śāriputra, is the tenth of the tathāgatas’ tathāgata powers, and with this power the Tathāgata asserts the state of the supreme bull, roars a true lion’s roar in the assembly, and turns the holy wheel that no ascetic, brahmin, and so forth of this world has legitimately turned.

source: དེ་ལྟར་ཤ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་ལ་མངོན་པར་དད། ཡིད་ཆེས། རབ་ཏུ་རྟོག་པ་ནས་ངོ་མཚར་དང་། རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་དོ།། །།
en: “Therefore, Śāriputra, because of the inconceivable nature of these tathāgata qualities, the bodhisatva has great faith and trust in the tathāgatas’ powers. He has confidence in them, and so forth, and he considers them to be truly wondrous and extraordinary.

source: ཡང་ཤཱ་རིའི་བུ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་པར་དད། ཡིད་ཆེས་རབ་ཏུ་རྟོག་སོམ་ཉི་མི་བྱེད། ཐེ་ཚོམ་མི་ཟ་བ་ནས། ངོ་མཚར་དང་། རྨད་ཀྱི་བར་དུ་འདུ་ཤེས་སྐྱེད་ཅེ་ན། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་དེ་བཞིན་གཤེགས་པའི་མི་འཇིགས་པ་ནི་བཞི་པོ་འདི་དག་སྟེ། མི་འཇིགས་པ་དེ་དག་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་འཁོར་གྱི་ནང་དུ་སེང་གེའི་སྒྲ་ཡང་དག་པར་སྒྲོག་ཅིང་ཁྱུ་མཆོག་གི་གནས་སུ་ཞལ་གྱིས་འཆེ་སྟེ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེ་འམ། ལྷའམ། བདུད་དམ། སུས་ཀྱང་འཇིག་རྟེན་དུ་ཆོས་དང་འཐུན་པར་མ་བསྐོར་བ་ཚངས་པའི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་ཏོ། །
en: “Now, Śāriputra, what is it about the Tathāgata’s inconceivable tathāgata confidence that leads the bodhisatva to have great faith in it? What is it that leads the bodhisatva to trust and believe in it, not to doubt it, and so forth, and to consider it to be truly wondrous and extraordinary? Śāriputra, the Tathāgata has four types of inconceivable tathāgata confidence, and with these confidences the Tathāgata roars a true lion’s roar in the assembly, asserts the state of the supreme bull, and turns the holy wheel that no ascetic, brahmin, or māra of this world has legitimately turned.

source: བཞི་གང་ཞེ་ན། འདི་ལ་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་བླ་ན་ མེད་པའི་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དང་ལྡན་པས་འཁོར་གྱི་ནང་དུ་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སོ་ཞེས་ཞལ་གྱིས་འཆེ་བ་དེ་ལ་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱིས་དེ་བཞིན་གཤེགས་པ་ལ་ཁྱོད་ཀྱིས་ཆོས་འདི་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་སོ་ཞེས་ཆོས་དང་འཐུན་པར་རྒོལ་བར་བྱེད་མི་ནུས་སོ། །
en: “What are these four types of confidence? When, Śāriputra, the Tathāgata with his unsurpassed tathāgata knowledge is in the midst of an assembly and asserts, ‘I am a fully accomplished buddha,’ the world with its gods is not able to challenge him by claiming legitimately, ‘You have not understood this dharma.’

source: དེ་ལ་ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཞེས་བྱ་ཞེ་ན། དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་མི་མཉམ་པ་མེད་པར་ཡང་དག་པར་མངོན་པར་སངས་རྒྱས་ཏེ། སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། འཕགས་ཆོས་པའི་རྣམས་གང་ཡིན་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། སློབ་པའི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། མི་སློབ་པའི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པ་གང་ཡིན་པ་དང་། འཇིག་རྟེན་གྱི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམས་གང་ཡིན་པ་དང་། །ཁ་ན་མ་ཐོས་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་དེ་དག་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱིས་མཉམ་པར་དེ་བཞིན་གཤེགས་པས་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ། དེའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤེས་བྱའོ། །
en: “One may then ask in what manner the Tathāgata is a fully accomplished Buddha. All dharmas without exception have been completely and fully understood by the Tathāgata. Whether it is the dharmas of ordinary people, the dharmas of the noble ones, the dharmas of the Buddha, the dharmas of learning, the dharmas of no more learning, the dharmas of the pratyekabuddha, the dharmas of the bodhisatva, which are the same as sameness, the worldly dharmas, the dharmas that transcend the world, the reproachable and irreproachable, the defiled and undefiled, or the conditioned and unconditioned, the Tathāgata fully understands that they are the same as sameness. This is why the Tathāgata is said to be a fully accomplished buddha.
